String Server ='http://bahaa.skoobudy.com';
String CustomerImageUrl='$Server/public/imgCustomer/';
String ProductsImageUrl='$Server/public/imgProduct/';
String OffersImageUrl ='$Server/public/imgOffer/';

int user_id;

var apis = {
  'login': '/login',
  'updateProfile': '/updateProfile',
  'getProfile': '/getProfile',
  'getOffers': '/getOffers',
  'sendOffers': '/sendOffers',
  'sendPricing': '/sendPricing',
  'getReply': '/getReply',
  'getproducts': '/getProducts',
};


var data1 = [
  {
    "name": "DGS-1010MP",
    "price": "100000",
    "image": "images/1.jpg",
    "description":" يتألف من 8 Port  بسرعة 10/100/1000  يدعم خاصة ال POE  لتشغيل الأجهزة التي تدعم هذه الخاصية . يحوي على منفذ بسرعة 1G  بالإضافة الى منفذ SFP  لإستخدام الكبلات الضوئية . والكثير من الميزات ..",

  },
  {
    "name": "IPC-HDBW2421RP-ZS",
    "price": "15000",
    "image": "images/2.jpg",
    "description":"' تأتي هذة الكاميرا بدقة 4MP تعمل في الوضع الليلي او عند الإضاءة الجيدة . تكشف الى 30M  في الظلام . تدعم معيار IP67 المقاوم للعوامل الخارجية . تدعم تقنية POE  يمكن توصيل التغذية عن طريق كبل الشبكة ذاته . يمكن تركيب SD   للتخزين الذاتي . والكثير من الميزات الجميلة .'",
  },
  {
    "name": "DSP-W245",
    "price": "30000",
    "image": "images/3.jpg",
    "description":"' منزلك الأن أكثر ذكاء مع هذا المنتج من شركة Dlink  العالمية ضمن فئة (Smart Home) الذي يتح لك التحكم بأربع أجهزة في نفس الوقت . كما يمكنك تحديد جدول زمني للإيقاف والتشغيل . كما أن الجهاز مزود بحساس حرارة لمعرف حرارة الجهاز وإيقافه عند حدوث مشكلة . ويمكن الإطلاع على مقدار الطاقة المستخدم من قبل الأجهزة . يمكن التحكم بالأجهزة عن طريق الموبايل من خلال ربطه بتطبيق MY Dlink  . '",
  },
  {
    "name": "DCS-F4724E",
    "price": "25000",
    "image": "images/4.jpg",
    "description":"' تأتي هذه الكاميرا بدقة 4MP FULL HD بفتحة عدسة 2.8mm . يمكن توصيل التغذية عن طريق كبل الشبكة . يمكن التسجيل باكثر من دقة . يمكن الرؤية في ظروف الإضاء الضعيفة لمدى يصل الى 20_30M . مصممة للتركيب الخارجي مع إمكانية تركيبها بالداخل . تعمل في ظروف الإضائة المنخفضة وشبه المعدومة . مزودة بي MIC  داخلي . والكثير من الميزات ... '",
  },
  {
    "name": "DCS-F4612",
    "price": "100000",
    "image": "images/5.jpg",
    "description":"'تعد كاميرا D-Link DCS-F4612 Vigilance Full HD Outdoor عالية الدقة ;حل المراقبة المناسب للمؤسسات الصغيرة والمتوسطة والكبيرة. تستخدم الكاميرا مستشعر CMOS لمسح ضوئي بدقة 2 ميجابكسل مع صورة WDR مدمجة. تقوم بتحسين الصورة بشكل رائع في جميع الظروف كما تحتوي على LED IR يصل الى بعد 15M. تأتي مع تصميم مميز وتعمل عن طريق كبل الشبكة النحاسي . تدعم مميزة Region of Interest (ROI): التي تقوم بتحديد منطقة الاهتمام ليتم تسجيلها بدقة عالية ويتم تسجيل بقية المنطقة بدقة أقل لتحسين الشبكة وتوفير مساحة التخزين . '",
  },
  {
    "name": "DGS-1010MP",
    "price": "100000",
    "image": "images/1.jpg",
    "description":"' يتألف من 8 Port  بسرعة 10/100/1000  يدعم خاصة ال POE  لتشغيل الأجهزة التي تدعم هذه الخاصية . يحوي على منفذ بسرعة 1G  بالإضافة الى منفذ SFP  لإستخدام الكبلات الضوئية . والكثير من الميزات ..'",

  },
  {
    "name": "IPC-HDBW2421RP-ZS",
    "price": "15000",
    "image": "images/2.jpg",
    "description":"' تأتي هذة الكاميرا بدقة 4MP تعمل في الوضع الليلي او عند الإضاءة الجيدة . تكشف الى 30M  في الظلام . تدعم معيار IP67 المقاوم للعوامل الخارجية . تدعم تقنية POE  يمكن توصيل التغذية عن طريق كبل الشبكة ذاته . يمكن تركيب SD   للتخزين الذاتي . والكثير من الميزات الجميلة .'",
  },
  {
    "name": "DSP-W245",
    "price": "30000",
    "image": "images/3.jpg",
    "description":"' منزلك الأن أكثر ذكاء مع هذا المنتج من شركة Dlink  العالمية ضمن فئة (Smart Home) الذي يتح لك التحكم بأربع أجهزة في نفس الوقت . كما يمكنك تحديد جدول زمني للإيقاف والتشغيل . كما أن الجهاز مزود بحساس حرارة لمعرف حرارة الجهاز وإيقافه عند حدوث مشكلة . ويمكن الإطلاع على مقدار الطاقة المستخدم من قبل الأجهزة . يمكن التحكم بالأجهزة عن طريق الموبايل من خلال ربطه بتطبيق MY Dlink  . '",
  },
  {
    "name": "DCS-F4724E",
    "price": "25000",
    "image": "images/4.jpg",
    "description":"' تأتي هذه الكاميرا بدقة 4MP FULL HD بفتحة عدسة 2.8mm . يمكن توصيل التغذية عن طريق كبل الشبكة . يمكن التسجيل باكثر من دقة . يمكن الرؤية في ظروف الإضاء الضعيفة لمدى يصل الى 20_30M . مصممة للتركيب الخارجي مع إمكانية تركيبها بالداخل . تعمل في ظروف الإضائة المنخفضة وشبه المعدومة . مزودة بي MIC  داخلي . والكثير من الميزات ... '",
  },
  {
    "name": "DCS-F4612",
    "price": "100000",
    "image": "images/5.jpg",
    "description":"'تعد كاميرا D-Link DCS-F4612 Vigilance Full HD Outdoor عالية الدقة ;حل المراقبة المناسب للمؤسسات الصغيرة والمتوسطة والكبيرة. تستخدم الكاميرا مستشعر CMOS لمسح ضوئي بدقة 2 ميجابكسل مع صورة WDR مدمجة. تقوم بتحسين الصورة بشكل رائع في جميع الظروف كما تحتوي على LED IR يصل الى بعد 15M. تأتي مع تصميم مميز وتعمل عن طريق كبل الشبكة النحاسي . تدعم مميزة Region of Interest (ROI): التي تقوم بتحديد منطقة الاهتمام ليتم تسجيلها بدقة عالية ويتم تسجيل بقية المنطقة بدقة أقل لتحسين الشبكة وتوفير مساحة التخزين . '",
  },
];